<template>
  <div>
    <div class="text_box">
      <div class="text_content" id="JS_terms_contents">
        <p class="fct"><img class="logo" src="@/assets/text_logo.png" alt=""></p>
        <h1><span>《边乐云VIP会员服务协议》</span></h1>
        <p class="tem">尊敬的边乐网用户，欢迎您注册并使用边乐云为您提供的VIP增值服务。在此特别提醒：如您欲访问或使用边乐云网址或提供的服务，必须事先认真阅读本会员服务协议。关于本边乐云VIP会员服务协议（下称“本服务协议”）提示您特别关注限制、免责条款，边乐云对您违规、违约行为的认定处理条款，以及管辖法院的选择条款等。限制、免责条款可能以加粗或加下划线形式提示您注意。如您对本协议的内容有任何疑问，可发邮件至<a href="mailto:kefu@bianyue.cn" class="blue">kefu@bianyue.cn</a>联系我们进行询问，边乐云将向您解释条款内容。如果您不同意本服务协议的任意内容，或者无法准确理解对协议条款的解释，请不要进行后续操作。您不得以未阅读本服务协议条款内容或者未获得边乐云的问询解答途径等理由作任何形式的抗辩。</p>
        <p class="tem">未成年人应在法定监护人陪同下审阅和履行，未成年人行使和履行本协议项下的权利和义务视为已获得了法定监护人的认可。</p>
        <h3>1. 完整协议</h3>
        <p class="tem">1.1 本协议视为《边乐云用户服务条款》（链接地址：http://vip.bianyue.cn/AgreementUser，若链接地址变更的，则以变更后的链接地址所对应的内容为准；其他链接地址变更的情形，均适用前述约定。）的补充协议，是其不可分割的组成部分。如《边乐云用户服务条款》与本服务协议有不同理解的，以本服务协议为准。</p>
        <p class="tem">1.2 边乐云所提供的服务将按照其服务协议和操作规则严格执行。用户在使用边乐云任何单项服务时，应当受本协议以及单项软件及服务相关的用户协议的约束。</p>
        <p class="tem">1.3 边乐云在http://vip.bianyue.cn/公示的相关说明、价格、注册、管理流程、规范和用户确认同意的订购页面是本服务协议不可分割的一部分。如http://vip.bianyue.cn/公示的会员相关说明、价格公示、注册、管理流程、规范和用户确认同意的订购页面与本服务协议有不同理解的，以本服务协议为准。</p>
        <p class="tem">1.4 边乐云有权以提前30天在http://vip.bianyue.cn/上公布、或给用户发网站内通知或书面通知的方式将本服务协议的权利义务全部或者部分转移给边乐云的关联公司。</p>
        <p class="tem">1.5 如果任何条款在性质上或其他方面理应地在此协议终止时继续存在，那么应视为继续存在的条款，这些条款包括但不局限于保证条款、保密条款、知识产权条款、法律适用及争议解决条款。</p>
        <h3>2. 关于本服务</h3>
        <p class="tem">2.1 收费说明</p>
        <div class="mar_left_17 bg">
        <p>2.1.1 边乐云VIP会员服务是边乐云向用户提供的需用户有偿付费才能使用的互联网电信增值服务（具体的增值服务项目以边乐云根据实际情况提供并不时公布的为准），用户选择具体的增值服务种类并付费、激活服务后即成为边乐云VIP会员（下称“会员”）。</p>
        <p>2.1.2 用户理解并知悉，边乐云可能会根据本服务的整体规划，对本服务的收费标准、方式等进行修改和变更，前述修改、变更，边乐云将在相应服务页面进行展示。您若需要获取、使用本服务，请先提前了解清楚当时关于本服务的收费标准、方式等信息。</p>
        <p>2.1.3 边乐云可能会根据不同的产品及服务类型，推出不同的增值服务。目前，边乐云提供VIP包月服务、VIP年费服务、VIP全球卡服务、VIP全球券服务、超级会员服务、永久会员服务等不同种类的增值服务。同时，边乐云也可能会根据用户的需求、产品及服务类型的变化等，对现有增值服务种类进行调整以及不断推出新的增值服务种类。边乐云也可能会在不同时间推出具体不同的服务内容，以不断完善、优化本服务。具体增值服务种类及服务内容以相关服务页面公布、实际提供的内容为准。用户可以自行根据需要选择相应服务。</p>
        </div>
        <p class="tem">2.2 服务期限
        <div class="mar_left_17 bg">
        <p>2.2.1 本服务的服务期限以用户自行选择并支付相应服务费用的期限为准，用户也可以登陆边乐云个人中心或者本服务的相应页面查询。</p>
        <p>2.2.2 本服务的服务开通最高期限会受到一定限制，具体以边乐云制定的的规则为准。</p>
        <p>2.2.3 服务期满用户愿意继续使用会员服务的，应至少在服务期满前7天内支付续费款项，以使服务得以继续进行。如续费时边乐云对产品体系、名称或价格进行调整的，双方同意按照届时有效的新的产品体系、名称或价格履行。如果用户没有在到期前继续支付费用，边乐云有权在服务期届满时停止并关闭向您提供的会员服务，您应于服务关闭前迁出您因付费获取会员服务所存储在边乐云服务器内的所有数据。</p>
        </div>
        <h3>3. 如何获得会员服务</h3>
        <p class="tem">3.1 本服务是边乐云提供的收费服务，用户须在按照本服务的收费标准支付相应费用后，方可使用本服务，成为边乐云VIP会员。</p>
        <p class="tem">3.2 用户可在官方网站（http://vip.bianyue.cn/）按照边乐云指定的支付方式，包括但不限于银联、支付宝、财付通、微信支付、手机充值或者信用卡快捷支付等现有方式、今后边乐云指定方式在依约支付一定费用后开通本服务，购买并开通会员服务。</p>
        <p class="tem">3.3 任何未经授权销售边乐云会员服务的属于非法销售，边乐云有权追究其法律责任。</p>
        <p class="tem">3.4 边乐云在此声明：</p>
        <p class="tem">3.4.1 本服务开通后，不可转让；</p>
        <p class="tem">3.4.2 如边乐云发现用户通过以下任一方式获取边乐云VIP服务的，有权根据情况采取相应的处理措施，包括但不限于立即终止服务、中止服务或删除相应信息等，且已收费用不予退回。</p>
        <div class="mar_left_17 bg">
        <p>(1) 以营利、经营等非个人使用的目的为自己或他人开通本服务；</p>
        <p>(2) 通过任何机器人软件、蜘蛛软件、爬虫软件、刷屏软件等任何程序、软件方式为自己或他人开通本服务；</p>
        <p>(3) 通过任何不正当手段或以违反诚实信用原则的方式为自己或他人开通本服务；</p>
        <p>(4) 通过非边乐云指定的方式为自己或他人开通本服务；</p>
        <p>(5) 通过侵犯边乐云或他人合法权益的方式为自己或他人开通本服务；</p>
        <p>(6) 通过其他违反相关法律、行政法规、国家政策等的方式为自己或他人开通本服务。</p>
        </div>
        <p class="tem">3.4.3 不论您通过何种方式或渠道加入会员，皆应仔细阅读并充分理解本服务协议和使用方法。</p>
        <p class="tem">3.5 您应提供完整、真实、准确和最新的个人资料，该资料对于使用边乐云VIP会员服务至关重要。如个人资料不真实、不完整或未及时更新而产生的结果，均由您负责，边乐云不承担任何责任。</p>
        <p class="tem">3.6 如边乐云有合理理由怀疑您提供的资料错误、不实、过时或不完整的，边乐云有权向您发出询问或要求更改的通知，并有权直接做出删除相应资料的处理，直至中止、终止对您提供部分或全部服务。</p>
        <p class="tem">3.7 边乐云VIP会员服务一经购买不予退款。</p>
        <h3>4. 如何使用会员服务</h3>
        <p class="tem">4.1 会员享有会员权利的同时应遵守《边乐云用户服务协议》及边乐云在http://vip.bianyue.cn/公布的会员服务的各项规章制度。若用户的行为不符合以上提到的服务条款或边乐云认为会员行为有损边乐云或他人的声誉及利益，边乐云将作出独立判断立即取消用户的会员帐号。被取消VIP资格的会员，不能再参加由边乐云组织的活动并不可再享有由边乐云提供的各项优惠及增值服务，即不再享有会员权利。</p>
        <p class="tem">4.2 会员服务仅限于申请帐号自行使用，禁止用户进行帐号共享、赠与、借用、租用、转让或售卖。因前述原因导致帐号或密码丢失，边乐云有权不予找回。如发生帐号登陆异常，边乐云将有权在未经通知的情况下对帐号采取暂停使用、取消会员服务资格、回收帐号等措施。</p>
        <p class="tem">4.3 边乐云禁止用户私下有偿或无偿转让会员帐号及其中的虚拟物品，用户应当自行承担因违反此要求而遭致的任何损失，同时边乐云保留追究上述行为人法律责任的权利。</p>
        <p class="tem">4.4 在会员服务有效期内，会员可参加由边乐云组织的活动并享有由边乐云提供的各项优惠及增值服务，具体以边乐云公告的活动规则、优惠政策为准。会员有权利选择参加或者不参加边乐云为会员组织的活动。</p>
        <p class="tem">4.5 会员不得使用含有下列内容的呢称和签名档，一经发现，边乐云有权取消其会员资格。</p>
        <div class="mar_left_17 bg">
        <p>4.5.1 不得使用党和国家领导人或其他社会名人的真实姓名、字号、艺名、笔名；</p>
        <p>4.5.2 不得使用以国家机构或其他机构的名称；</p>
        <p>4.5.3 不得使用不文明、不健康名字，或包含歧视、侮辱、猥亵、淫秽类词语；</p>
        <p>4.5.4 不得使用易产生歧义、引起他人误解或其它不符合法律法规、规章制度、低俗、违反社会主义精神文明的内容。</p>
        </div>
        <p class="tem">4.6 用户不得私自以边乐云名义对外进行任何形式的承诺，举办未经边乐云允许的活动，如有损害边乐云名誉，商业利益等一切有危害性的行为发生，边乐云有权取消该会员的资格，并保留进一步追究该行为法律责任的权利。</p>
        <p class="tem">4.7 在边乐云VIP会员所含服务中，用户保证对向边乐云提供的作品享有著作权，用户的上载行为即意味着用户或用户代理的著作权人免费授权边乐云对上载作品享有独家的、全球范围内不可撤销的永久的复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权、使用权和收益权，而且边乐云还可以将上述权利转让或者转授予给其他公司或个人。如用户与边乐云另有约定的，从其约定。</p>
        <h3>5. 服务的变更、修订、中止与终止</h3>
        <p class="tem">用户需充分了解并同意，由于互联网服务的特殊性，边乐云可能会按照相关法规、双方约定或在其他必要时，中止或终止向您提供本服务。届时，边乐云会依法保护您的合法权益。</p>
        <h3>6. 隐私及其他个人信息的保护</h3>
        <p class="tem">一旦您同意本协议或使用本服务，您即同意按照<a href="/Agreementprivacy" class="blue" target="_blank">《边乐云隐私政策》</a>约定来使用和披露您的个人信息。</p>
        <h3>7. 会员服务的通知和公告办法</h3>
        <p class="tem">会员服务的通知和公告将通过以下形式之一或多种形式对会员发布：</p>
        <p class="tem">(1) 边乐云客户端软件；</p>
        <p class="tem">(2) E-mail；</p>
        <p class="tem">(3) 边乐云网站主页的公告专栏；</p>
        <p class="tem">(4) 边乐云社区。</p>
        <h3>8. 责任声明</h3>
        <p class="tem">8.1 凡参加边乐云组织的活动获得赠送或优惠产品的会员，如因前述产品遭受任何人身或财务的损失、损害或伤害，不论原因为何，边乐云不负责任，会员可以直接向产品服务的提供商提出权利要求。</p>
        <p class="tem">8.2 会员须对其自身及其所邀请的宾客在参加边乐云组织的活动或使用由边乐云提供的各项优惠及增值服务时的一切行为、行动及违法、违规或疏忽行为（不论是否故意）负全部责任。</p>
        <p class="tem">8.3 如边乐云的系统发生故障影响到会员服务的正常运行，边乐云承诺在第一时间内与相关单位配合，及时处理进行修复。但用户因此而产生的经济损失，边乐云和合作公司不承担责任。</p>
        <p class="tem">8.4 使用会员功能涉及到互联网服务，可能会受到各个环节不稳定因素的影响，存在因不可抗力、计算机病毒、黑客攻击、系统不稳定、用户所在位置、用户关机以及其他任何网络、技术、通信线路等原因造成的服务中断或不能满足用户要求的风险，用户须明白并自行承担以上风险，边乐云不承担任何责任，并不予以亦无法补偿。</p>
        <p class="tem">8.5 用户使用某些会员功能可能存在第三方通过恶意或其他手段获得验证问题的答案、密钥等从而造成相关的风险，用户须明白并自行承担以上风险，用户可通过每次设置高安全系数的密钥和验证问题等并采取有效的保密措施来减小上述风险。边乐云不对任何由第三方导致的用户损失承担责任。</p>
        <p class="tem">8.6 用户明确同意使用边乐云服务的风险由用户个人承担。边乐云明确表示不提供任何类型的担保，不论是明确的或隐含的。边乐云不担保服务一定能满足用户的要求，也不担保服务不会受中断，对服务的及时性、安全性、真实性、出错发生、无病毒、无疏忽或无技术瑕疵问题都不作担保。边乐云拒绝提供任何担保，包括信息能否准确、及时、顺利地传送。用户理解并接受下载或通过边乐云服务取得的任何信息资料取决于用户自己，并由其承担系统受损、资料丢失以及其它任何风险。</p>
        <p class="tem">8.7 用户违反本《协议》或相关的服务条款的规定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的诉讼费用和律师费用，用户同意赔偿边乐云与合作公司、关联公司，并使之免受损害。对此，边乐云有权视用户的行为性质，采取包括但不限于中断使用许可、停止提供服务、限制使用、法律追究等措施。</p>
        <h3>9. 禁止服务的商业化</h3>
        <p class="tem">用户使用边乐云VIP会员服务的权利是个人的。用户只能是一个单独的个体而不能是一个公司或实体的商业性组织。用户承诺不经边乐云同意，不能利用边乐云VIP会员服务进行销售或其他商业用途。</p>
        <h3>10. 青少年用户必须遵守全国青少年网络文明公约：</h3>
        <p class="tem">要善于网上学习，不浏览不良信息；</p>
        <p class="tem">要诚实友好交流，不侮辱欺诈他人；</p>
        <p class="tem">要增强自护意识，不随意约会网友；</p>
        <p class="tem">要维护网络安全，不破坏网络秩序；</p>
        <p class="tem">要有益身心健康，不沉溺虚拟时空。</p>
        <h3>11. 知识产权保护</h3>
        <p class="tem">边乐云的知识产权政策是对符合《信息网络传播权保护条例》和其它适用的知识产权法律规定的声称侵权之通告进行回复和处理。</p>
        <p class="tem">任何单位或个人认为，通过搜索引擎、网站等渠道获得的链接或者用户上载的链接可能涉嫌侵犯其合法权益的，应及时向边乐云书面反馈，详见边乐云<a href="/AgreementCopyright" class="blue" target="_blank">《版权声明》</a>。</p>
        <h3>12、 法律适用和管辖</h3>
        <p class="tem">本《协议》的解释、效力及纠纷的解决，适用于中华人民共和国法律。若用户和边乐云之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，用户在此完全同意将纠纷或争议提交边乐云所在地法院管辖。</p>
      </div><!-- 内容  -->
    </div>
    <div id="js_terms_nav" class="show_pc terms-nav">
      <p class="fd aa">在这篇文章中：</p>
      <ul>
        <li v-for="(data,index) in navArr" @click="scrollTo(index)" :key="data" :class="{current:currentIndex==index}"><s></s><a
            href="javascript:;" :title="data">{{data}}</a></li>
      </ul>
      <a href="javascript:;" class="go_top" @click="scrollTo('top')"><s></s>返回顶部</a>
    </div><!-- 右侧浮窗 -->
  </div>
</template>
<script>
  import '@/assets/agreement.css';
  export default {
    name: 'AgreementVip',
    data() {
      return {
        currentIndex: 0,
        navArr: ['完整协议','关于本服务','获得会员服务','使用会员服务','变更中止或终止','用户信息保护','通知和公告办法','责任声明','禁止商业化','网络文明公约','知识产权保护','法律适用和管辖'],
        offsetTopArr: []
      }
    },
    methods: {
      // 滚动
      scrollTo(data) {
        this.isClick = true;
        if (data == 'top') {
          $('body').animate({
            scrollTop: 0
          });
        } else {
          this.currentIndex = data;
          $('body').animate({
            scrollTop: this.offsetTopArr[this.currentIndex] - 50
          }, () => {
            this.isClick = false;
          });
        }
      }
    },
    mounted() {
      $(".layout-frame").addClass('layout-new-frame');
      $("#JS_terms_contents").find('h3').each((index, ele) => {
        this.offsetTopArr.push($(ele).offset().top);
      })
      $("body").scroll(() => {
        if (!this.isClick) {
          let top = $('body').scrollTop();
          this.offsetTopArr.forEach((element, index) => {
            let offsetTop = element - 50;
            if (top >= offsetTop) {
              this.currentIndex = index;
            }
          });
        }
      })
    },
    created() {
      document.getElementsByTagName("title")[0].innerHTML = '边乐云VIP会员服务协议';
    },
  }

</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>

</style>
