<template>
  <div>
    <div class="text_box">
      <div class="text_content" id="JS_terms_contents">
        <p class="fct"><img class="logo" src="@/assets/text_logo.png" alt=""></p>
        <h1><span>《边乐云隐私政策》</span></h1>
        <h3>引言</h3>
        <p class="tem">边乐云重视用户信息的保护，但在您使用到我们的服务时，我们有可能会收集和使用到您的相关信息。本《边乐云隐私政策》旨在向您阐明，您在使用边乐云服务时，我们是如何收集、使用和保护您的信息的。在使用边乐云提供的边乐云服务前，请您务必审慎阅读、充分理解《边乐云隐私政策》。一旦您使用边乐云服务，即表示您认可并接受《边乐云隐私政策》的约束。</p>
        <h3>1. 我们收集的信息</h3>
        <p class="tem">1.1 您向边乐云提供的信息。</p>
        <p class="tem">您为注册帐号或使用边乐云提供的服务时，向边乐云提供的个人信息，包括但不限于您的手机号码、邮箱地址、身份证号码、银行卡号等。在您自愿选择服务或提供相关信息的情况下，边乐云的服务系统将自动存储前述信息。</p>
        <p class="tem">1.2 您在使用边乐云的服务时，我们获取的信息。</p>
        <div class="mar_left_17 bg">
        <p>1.2.1 日志信息：当您使用边乐云服务时，服务器会自动记录一些信息，例如您对我们服务的使用情况、IP地址、所访问服务的URL、浏览器的类型和使用的语言以及访问日期和时间等。</p>
        <p>1.2.2 崩溃信息：当您在使用边乐云服务时出现崩溃或者其他异常时，边乐云会在得到您的确认后，将崩溃报告发送给边乐云。崩溃报告可以帮助我们诊断边乐云所出现的问题。边乐云会尽量避免发送用户个人身份识别信息，但是崩溃报告会包含关于故障发生时您的操作系统版本和运行状况等。</p>
        <p>1.2.3 设备信息：某些产品和/或服务包含唯一应用程序编号。当您安装、激活、更新、卸载相关服务或当这些服务定期与边乐云通信（例如软件的更新）时，系统会将此编号以及与安装相关的信息（例如操作系统类型和应用程序版本号）发送给边乐云。为了对不同型号的设备提供更好的服务与体验改善，边乐云会记录硬件型号、操作系统版本号、手机的国际移动设备身份码（IMEI）、手机的网络设备的硬件地址（MAC）等信息。</p>
        <p>1.2.4 位置信息：当您使用具有定位功能的边乐云服务时，系统会自动处理有关设备的位置信息，以使得您不需要手动输入自身地理坐标就可获得相关服务。例如在边乐云地图服务中，如果您使用“当前位置”进行地理查询， 边乐云可能会向您提供基于位置的服务。</p>
        <p>1.2.5 Cookie信息：</p>
        <div class="mar_left_17">
          <p>(1) Cookie主要是用于认证您的身份并帮助网站进行数据统计，有助于我们根据您的信息为您提供更加周到的个性化服务，例如广告优化，向您提供与您相关的广告而非进行普遍的广告投放</p>
          <p>(2) 当您使用边乐云产品或服务时，会向您的设备发送Cookie，您与我们提供给合作伙伴的服务（例如广告和/或推广服务，以及可能显示在其他网站上的由边乐云提供的服务功能）进行交互时，我们允许Cookie发送给边乐云服务器。</p>
          <p>(3) 您可以选择拒绝Cookie。您可以通过修改浏览器设置的方式拒绝Cookie。如果您选择拒绝Cookie，则您可能无法登录或使用依赖于Cookie的边乐云服务或功能。</p>
        </div>
        <p>1.2.6 用户体验改进计划：</p>
        <div class="mar_left_17">
        <p>(1) 您在使用边乐云产品时，我们会邀请您参加用户体验改进计划，您可以选择拒绝参加。</p>
        <p>(2) 为了改善产品，满足用户新的需求，我们会持续增加和改善产品功能，因此我们需要知道每个产品功能的使用量，即有多少用户在使用这个产品功能，以便我们能够对每个产品功能的重要性做出正确的判断。</p>
        <p>(3) 如果您参加了这个计划，我们将收集边乐云一些功能的使用次数，参数设置信息；手机版本的云盘用户体验改进计划将会收集您的手机型号、软件系统版本号及部分功能使用的情况数据。对于收集到的数据，我们会进行汇总统计分析，以便不断改进我们的产品。</p>
        <p>(4) 您可以随时在设置中心选择参加或取消加入我们的用户体验改进计划。</p>
        </div>
        </div>
        <h3>2. 我们如何使用您的信息</h3>
        <p class="tem">2.1 改善服务，提高用户体验</p>
        <p class="tem">通过使用收集的信息，边乐云将会更了解您如何使用我们的服务，从而向您提供个性化的服务并可以帮助边乐云改进边乐云产品或开发新的产品/服务。</p>
        <p class="tem">2.2 账号安全保护</p>
        <p class="tem">我们提供服务时，用于身份验证、客户服务、安全防范、诈骗监测、存档和备份用途，确保我们向您提供的产品和服务的安全性。</p>
        <p class="tem">2.3 广告服务</p>
        <p class="tem">边乐云可能会与合作伙伴共同向您提供您所要求的服务或者共同向您展示您可能感兴趣的内容，包括：</p>
        <div class="mar_left_17 bg">
        <p>(1) 即时通讯服务、网上媒体服务、互动娱乐服务、社交网络服务、付款服务、互联网搜索服务、位置和地图服务、应用软件和服务、数据管理软件和服务、网上广告服务、互联网金融，以及其他社交媒体、娱乐、电子商务、资讯和通讯软件或服务（统称“互联网服务”）；</p>
        <p>(2) 第三方互联网服务供应商，以及与下列有关的第三方商品或服务：食物和餐饮、体育、音乐、电影、电视、现场表演及其他艺术和娱乐、书册、杂志和其他刊物、服装和配饰、珠宝、化妆品、个人健康和卫生、电子、收藏品、家用器皿、电器、家居装饰和摆设、宠物、汽车、酒店、交通和旅游、银行、保险及其他金融服务、会员积分和奖励计划，以及我们认为可能与您相关的其他商品或服务。</p>
        <p>(3) 在信息为该项产品/服务所必须的情况下，您同意边乐云可与其分享必要的信息。如您不希望我们将您的个人信息用作前述广告用途，您可以通过我们在广告中提供的相关提示，或在特定服务中提供的指引，要求我们停止为上述用途使用您的个人信息。</p>
        </div>
        <p class="tem">2.4 数据统计</p>
        <p class="tem">边乐云可能会对产品使用情况进行统计。同时，边乐云可能会与公众分享这些统计信息，以展示我们服务的整体使用趋势。这些统计信息不包含您的个人身份识别信息。</p>
        <p class="tem">2.5 信息分享</p>
        <p class="tem">在如下情况下，边乐云可能会披露您的信息：</p>
        <div class="mar_left_17 bg">
        <p>(1) 事先获得您的授权；</p>
        <p>(2) 您使用共享功能；</p>
        <p>(3) 根据法律、法规、法律程序的要求或政府主管部门的要求；</p>
        <p>(4) 以学术研究或公共利益为目的；</p>
        <p>(5) 为维护边乐云的合法权益，例如查找、预防、处理欺诈或安全方面的问题；</p>
        <p>(6) 符合相关服务条款或使用政策的规定。</p>
        </div>
        <h3>3. 信息保护说明</h3>
        <p class="tem">边乐云重视信息安全，研发和应用多种安全技术和程序以防信息的丢失、不当使用、未经授权阅览或披露。但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全。您需要了解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的因素而出现问题。</p>
        <h3>4. 产品服务说明</h3>
        <p class="tem">4.1 手机资料备份</p>
        <div class="mar_left_17 bg">
        <p>4.1.1 手机在使用的过程中，可能会因系统崩溃、硬件损坏、刷写手机系统固件、手机丢失等问题，发生通讯录、短信等信息丢失的情况。数据云备份可以将通讯录、手机相片和手机视频等重要资料加密后备份到边乐云安全中心。当用户手机资料出现意外丢失，可将资料快速恢复到手机中，避免损失。手机备份实现了跨手机操作系统的数据备份与恢复，当您更换手机时不必再为导入旧手机中的通讯录和手机相片等信息而烦恼。</p>
        <p>4.1.2 手机备份功能已经支持备份/恢复的资料：</p>
        <p class="mar_left_17">
        (1) 手机通信录<br>
        (2) 图片<br>
        (3) 视频<br>
        以上每一项内容均为用户可选项
        </p>
        <p>4.1.3 手机备份服务涉及的行为描述：</p>
        <p class="mar_left_17">(1) 当您选择备份数据后，需要将个人手机中的备份数据加密上传至边乐云进行存储备份，以保证在日后有需要时取回或者恢复数据。手机备份和恢复是用户选择性功能，只有在您选择使用该功能后，边乐云才会为您提供这项服务，功能使用过程中产生的流量费用适用运营商相关规定。<br>
        (2) 手机备份服务会保存您的备份的历史记录，可以记录您每次的备份时间，方便您选择不同的备份点进行恢复，用户可主动删除其在边乐云所备份的数据信息。备份数据全部采用加密处理（包括上传和存储），以保证您的隐私数据不被任何未经授权的程序查看或访问。</p>
        </div>
        <p class="tem">4.2 隐藏模式。用户可以将重要的文件设置隐藏模式，为隐藏模式设置安全密钥，双重加密保护用户的文件安全。使用此功能，边乐云不会收集用户的个人信息。</p>
        <p class="tem">4.3 用户可以通过输入边乐云网名或者边乐云帐号查找好友并进行添加，可以通过手机通讯录匹配好友，发送加为好友的验证申请后，对方通过验证后互相成为好友。可以通过好友列表管理好友，还可以随时删除好友，删除后不能再发送和接收该用户的分享和信息。用户使用上述功能完全可以控制自己的好友列表，可以拒绝好友的验证申请，也可以将好友拉入黑名单。使用通讯录作好友信息匹配时，本软件会加密传输通讯录中的手机号到边乐云服务器，以便为用户匹配也在使用边乐云产品的好友。匹配过程加密完成，本软件不会传输和记录手机号对应的联系人名称，也不会不保存信息，不会将信息用做其它用途。</p>
        <h3>5. 您分享的信息</h3>
        <p class="tem">5.1 我们的多项服务，可让您不仅与自己的社交网络，也与使用云存储服务的所有用户公开分享您的相关信息。例如，您在我们的服务中所上传或发布的信息（包括您公开的个人信息、您建立的名单）、您对其他人上传或发布的信息作出的回应，以及包括与这些信息有关的位置数据和日志信息。使用我们服务的其他用户也有可能分享与您有关的信息（包括位置数据和日志信息）。特别是，我们的社交媒体服务，是专为使您与世界各地的用户共享信息而设计，您可以使共享信息实时、广泛地传递。只要您不删除共享信息，有关信息会一直留存在公共领域；即使您删除共享信息，有关信息仍可能由其他用户或不受我们控制的非关联第三方独立地缓存、复制或储存，或由其他用户或该等第三方在公共领域保存。因此，请您谨慎考虑通过我们的服务上传、发布和交流的信息内容。在一些情况下，您可通过我们某些服务的隐私设定来控制有权浏览您共享信息的用户范围。如要求从我们的服务中删除您的相关信息，请通过该等特别服务条款提供的方式操作</p>
        <p class="tem">5.2 某些个人信息因其特殊性可能被认为是敏感个人信息，例如您的种族、宗教、个人健康和医疗信息等。相比其他个人信息，敏感个人信息受到更加严格的保护。请注意，您在使用我们的服务时所提供、上传或发布的内容和信息（例如有关您社交活动的照片等信息），可能会泄露您的敏感个人信息。您需要谨慎地考虑，是否在使用我们的服务时披露相关敏感个人信息。您同意按《边乐云隐私政策》所述的目的和方式来处理您的敏感个人信息。</p>
        <h3>6. 您如何访问与控制您的信息</h3>
        <p class="tem">我们将尽一切可能采取适当的技术手段，保证您可以访问、更新和更正自己的注册信息或使用我们的服务时提供的其他个人信息。在访问、更新、更正和删除前述信息时，我们可能会要求您进行身份验证，以保障帐号安全。
        <h3>7. 未成年人信息保护</h3>
        <p class="tem">边乐云重视对未成年人信息的保护。若您是18周岁以下的未成年人，在使用边乐云的产品和/或服务前，应事先取得您的家长或法定监护人的同意。</p>
        <h3>8. 修订</h3>
        <p class="tem">边乐云可能适时修订《边乐云隐私政策》的条款，该等修订构成《边乐云隐私政策》的一部分。如该等修订造成您在《边乐云隐私政策》下权利的实质减少，我们将在修订生效前通过在主页上显著位置予以发布。在该种情况下，若您继续使用我们的服务，即表示同意受经修订的《边乐云隐私政策》的约束。</p>
        <p class="tem">附：名词解释</p>
        <div class="mar_left_17 bg">
        <p class="tem">1. 匿名标示符：匿名标示符通常是一类随机的字符串，通常用于识别包括特定移动设备在内的一些用户设备。例如手机的国际移动设备身份码（IMEI）、手机的网络设备的硬件地址（MAC）等。</p>
        <p class="tem">2. Cookie：支持服务器端（或者脚本）在客户端上存储和检索信息的一种机制，通过增加简单、持续的客户端状态来扩展基于Web的客户端/服务器应用。服务器在向客户端返回HTTP对象的同时发送一条状态信息，并由客户端保存。状态信息中说明了该状态下有效的URL范围。此后，客户端发起的该范围内的HTTP请求都将把该状态信息的当前值从客户端返回给服务器，这个状态信息被称为Cookie。</p>
        </div>

      </div><!-- 内容  -->
    </div>
    <div id="js_terms_nav" class="show_pc terms-nav">
      <p class="fd aa">在这篇文章中：</p>
      <ul>
        <li v-for="(data,index) in navArr" @click="scrollTo(index)" :key="data" :class="{current:currentIndex==index}"><s></s><a
            href="javascript:;" :title="data">{{data}}</a></li>
      </ul>
      <a href="javascript:;" class="go_top" @click="scrollTo('top')"><s></s>返回顶部</a>
    </div><!-- 右侧浮窗 -->
  </div>
</template>
<script>
  import '@/assets/agreement.css';
  export default {
    name: 'AgreementPrivacy',
    data() {
      return {
        currentIndex: 0,
        navArr: ['引言','我们收集的信息','如何使用信息','信息保护说明','产品服务说明','您分享的信息','访问与控制信息','未成年人保护','修订'],
        offsetTopArr: []
      }
    },
    methods: {
      // 滚动
      scrollTo(data) {
        this.isClick = true;
        if (data == 'top') {
          $('body').animate({
            scrollTop: 0
          });
        } else {
          this.currentIndex = data;
          $('body').animate({
            scrollTop: this.offsetTopArr[this.currentIndex] - 50
          }, () => {
            this.isClick = false;
          });
        }
      }
    },
    mounted() {
      $(".layout-frame").addClass('layout-new-frame');
      $("#JS_terms_contents").find('h3').each((index, ele) => {
        this.offsetTopArr.push($(ele).offset().top);
      })
      $("body").scroll(() => {
        if (!this.isClick) {
          let top = $('body').scrollTop();
          this.offsetTopArr.forEach((element, index) => {
            let offsetTop = element - 50;
            if (top >= offsetTop) {
              this.currentIndex = index;
            }
          });
        }
      })
    },
    created() {
      document.getElementsByTagName("title")[0].innerHTML = '边乐云隐私政策';
    },
  }

</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>

</style>
